Polish README for portfolio
